[
	{
		"id": "1",
		"name": "Gentse Feesten",
		"img": "static/images/gentse_feesten.png",
		"description": "For this project, we needed to recreate the website of the gentse feesten. I used JavaScript to make this website as dynamic as possible. ",
		"type": "coding",
		"url": "https://github.com/Jonasdegroote1/gentse-feesten/tree/main",
		"website": "https://pgmgent-atwork-1.github.io/opdracht-2-gentse-feesten-2022-Jonasdegroote1/"
	},
	{
		"id": "2",
		"name": "concertplanner",
		"img": "static/images/bijloke.png",
		"description": "Users can draw up a stage plans to scale in our Concert Hall. This must be very accessible and without licenses on drawing programs. The projects must be easily shareable in an editable version and as a final PDF document. Thus, the purpose of the tool should guarantee more efficient preparation, and its creator doesn't have to be a technical drawing professional ",
		"type": "coding",
		"url": "https://github.com/Jonasdegroote1/concertplanner/tree/main"
	},
	{
		"id": "3",
		"name": "interactive agancy website",
		"img": "static/images/interactive-agency.png",
		"description": "For this project, we needed to recreate the website of an agency website that has a lot of web animations in it. We used gsap to make these animations. There  are different types of animations on the site such as a fade-in, scroll animation that also changes the color of the site.",
		"type": "coding",
		"url": "https://github.com/Jonasdegroote1/clar-agancy"
	},
	{
		"id": "4",
		"name": "3D-Printing/modeling",
		"img": "static/images/dragon.png",
		"description": "In my spare time I like to make 3D models and print them. I use the program Blender to make these models. I also use the program Cura to print the models. I have already made a few models, but I am still learning to make more complex models. I have already made a dragon, a vase. I have also made a few other models, but I have not printed them yet. I have also made a few models for my school assignments.",
		"type": "3D",
		"url": ""
	},
	{
		"id": "5",
		"name": "stopmotion",
		"img": "static/images/stopmotion.png",
		"description": "For this assignment, we had to make a stop motion video that had to be one minute long. That is to say, by placing the pictures one after the other, you get a nice flow of the images you have drawn. There had to be about 12 images per second, which meant that we had to take at least 720 images in order to get a nice flow of the video.Before you can start the production, you must of course write a scenario. Then you make a storyboard of the scenario, which you can find below. For my subject, I came up with a transport company that goes to another planet to deliver a house on the other planet.I started by writing my scenario. Then I drew my storyboard with the different scenes on it. After that, I built my set with the resources I had at home. The next day, I prepared everything for shooting and took the pictures I needed. The next day, I assembled everything and finished off where necessary.",
		"type": "video",
		"url": "https://vimeo.com/419232001"
	},
	{
		"id": "6",
		"name": "labelicious",
		"img": "static/images/labelicious.png",
		"description": "For this project we had to design a packaging for vitamins and an energy drink, these products are for elderly people. The brand we have been given is genergise. The first thing I thought when I heard the name was energy and generation. Which in my view means that they are not too old yet and can still conquer the world with these vitamins, and with the energy they have gained from the vitamins and the energy drink.",
		"type": "design",
		"url": ""
	},
	{
		"id": "7",
		"name": "my sport app",
		"img": "static/images/sport_app.png",
		"description": "For this project we needed to design a sport application. we build a limited responsive web application for fellow fanatics who practice this sport that contains a few features that are perfectly tailored to your target group. We had a lot of freedom in this assignment, this doesn't mean that we wont pay attention to the relevance or the idea. In this assignment we did start with a brainstorm and went true all the steps of the design thinking process.",
		"type": "design/ux",
		"url": "https://www.figma.com/file/dfickD8PhtmKmh6SYa9iDi/Mijn-sportieve-applicatie?type=design&node-id=22%3A399&mode=design&t=RgddKIDm90HKT4LZ-1"
	},
	{
		"id": "8",
		"name": "schrauwen groen",
		"img": "static/images/schrauwen_groen.png",
		"description": "For this project, we needed to recreate the website of a company called schrauwen groen. It has a few different pages that does have other layouts. I did use javascript to make some pages dynamic, the content is loaded in from a json file.",
		"type": "website",
		"url": "https://github.com/Jonasdegroote1/schrauwen-groen",
		"website": "https://pgmgent-atwork-1.github.io/opdracht-1-schrauwen-groen-Jonasdegroote1/"
	},
	{
		"id": "9",
		"name": "3D kamer",
		"img": "static/images/3D_room.png",
		"description": "For this project, we needed to make a 3D room. We had to make a room with a few objects in it. This room is made is made with threejs and the objects are all made in blender.",
		"url": "https://github.com/pgmgent-2324-iwebapp/interactive-diorama-Jonasdegroote1",
		"type": "3D/website",
		"website": "https://pgmgent-2324-iwebapp.github.io/interactive-diorama-Jonasdegroote1/#/interactive-diorama"
	},
	{
		"id": "10",
		"name": "3D portfolio",
		"img": "static/images/3D_portfolio.png",
		"description": "For this project, we needed to make a 3D portfolio. We had to make a portfolio with a few objects in it. This portfolio is made is made with threejs and the objects are all made in blender.",
		"url": "https://github.com/pgmgent-2324-ixr/eindopdracht-Jonasdegroote1",
		"type": "3D portfolio",
		"website": "https://pgmgent-2324-ixr.github.io/eindopdracht-Jonasdegroote1/"
	},
	{
		"id": "11",
		"name": "eindwerk zottegemse dakwerken",
		"img": "static/images/zottegemse_dakwerken.png",
		"description": "For my final project, I've chosen to work with Drupal 10, which is a new CMS system that uses PHP. I opted for this because the website needs to be easily customizable for the client. My client is a roofer who wants to regularly update photos of their work on the site to keep it current. A CMS is very convenient for managing content like this. Additionally, we were expected to include something complex, so I decided to create an inventory system. This will allow the client to easily track their warehouse inventory from their computer. The issue was that sometimes they ran short of certain materials without realizing how low the stock was. This tool will be fully integrated into the admin panel so that they can easily use it to manage and track their inventory. Drupal 10's flexibility and the ability to customize with PHP made it a suitable choice for both the client's content management needs and the implementation of a more complex feature like the inventory system.",
		"type": "php",
		"url": "https://github.com/Jonasdegroote1/zottegemse-dakwerken",
		"website": "https://zottegemsedakwerken.be/"
	},
	{
		"id": "12",
		"name": "haunted house",
		"img": "static/images/haunted_house.png",
		"description": " for this project i did made a haunted house with a tutorial of threejs. I'm following the threejs journey course of Bruno Simon to get better in threejs. I'm still learning to make more complex models and scenes.",
		"type": "3D/website",
		"url": "https://github.com/Jonasdegroote1/16-haunted-house",
		"website": "https://16-haunted-house-git-main-jonas-s-projects.vercel.app/"
	},
	{
		"id": "13",
		"name": "Badminton tournaments",
		"img": "static/images/badminton.png",
		"description": "A sleek and user-friendly Next.js application that enables seamless browsing of badminton tournaments. Powered by a Vercel deployment, the interface offers dynamic tournament selection and efficient performance for a smooth user experience.",
		"type": "website",
		"url": "https://github.com/Jonasdegroote1/badminton-tournaments",
		"website": "https://badminton-tournaments.vercel.app/"
	}
]
